# FilterIntegerRule Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterIntegerRule Class
Members See Also
---
A filter rule that operates on integer values in a Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterIntegerRule : FilterNumericValueRule
```

Visual Basic
---
```text
Public Class FilterIntegerRule _
	Inherits FilterNumericValueRule
```

Visual C++
---
```text
public ref class FilterIntegerRule : public FilterNumericValueRule
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterRule Autodesk.Revit.DB..::..FilterValueRule Autodesk.Revit.DB..::..FilterNumericValueRule Autodesk.Revit.DB..::..FilterIntegerRule
# See Also
FilterIntegerRule Members
Autodesk.Revit.DB Namespace